test_config/cfe/DataProcessors/AVS_ВыгрузкаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>AVS_ВыгрузкаДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчиститьРегистрПослеВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVS_КатегорииНоменклатурыСайт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьПодкатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

test_config/cfe/DataProcessors/AVS_ВыгрузкаДанных/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Устанавливаем начальную видимость (чтобы при открытии всё было скрыто для "Полной выгрузки")
	УправлениеВидимостьюНаСервере();
	
	// 2. Устанавливаем значения по умолчанию при открытии формы
	// Если режим уже "Тестовая выгрузка", заполняем даты со временем
	Если Объект.РежимВыгрузки = 2 Тогда
		// Устанавливаем 00:00:00
		Объект.ДатаНачала = НачалоДня(?(ЗначениеЗаполнено(Объект.ДатаНачала), Объект.ДатаНачала, ТекущаяДата()));
		
		// Устанавливаем 23:59:59 
		Объект.ДатаОкончания = КонецДня(?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания, ТекущаяДата()));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьJSON(Команда)
	
	// 1. Проверка заполнения для тестового режима
	Если Объект.РежимВыгрузки = 2 И Объект.КорневаяКатегория.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите категорию для теста!");
		Возврат;
	КонецЕсли;
	
	// 2. Проверка выбора папки
	ТекКаталог = ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "КаталогВыгрузки"), Объект.КаталогВыгрузки, КаталогВыгрузки);
	
	Если ПустаяСтрока(ТекКаталог) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СформироватьJSONПослеВыбораКаталога", ЭтотОбъект);
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Заголовок = "Выберите папку для сохранения JSON-файлов";
		Диалог.Показать(ОписаниеОповещения);
		Возврат;
	КонецЕсли;
	
	ВыполнитьВыгрузкуИСохранениеЛокально();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьВыгрузкуНаСервере()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("Режим",               Объект.РежимВыгрузки);
	ПараметрыВыгрузки.Вставить("ДатаНачала",          Объект.ДатаНачала);
	ПараметрыВыгрузки.Вставить("ДатаОкончания",       Объект.ДатаОкончания);
	
	ОчисткаРазрешена = (Объект.РежимВыгрузки = 1) И Объект.ОчиститьРегистрПослеВыгрузки;
	ПараметрыВыгрузки.Вставить("ОчиститьРегистр",     ОчисткаРазрешена);
	
	ПараметрыВыгрузки.Вставить("КорневаяКатегория",   Объект.КорневаяКатегория);
	ПараметрыВыгрузки.Вставить("ВключатьПодкатегории", Объект.ВключатьПодкатегории);
	
	// 1. Выполняем выгрузку (файлы ложатся на диск сервера)
	ОбъектОбработки.ВыполнитьВыгрузку(ПараметрыВыгрузки);
	
	// 2. Вывод лога
	ЛогВыгрузки = ОбъектОбработки.ПолучитьЛог();
	Для Каждого СтрЛога Из ЛогВыгрузки Цикл
		Сообщить(СтрЛога.Значение);
	КонецЦикла;
	
	// 3. { ПРАВКА }: Перемещаем файлы с диска сервера во Временное хранилище
	СписокФайловСервер = ОбъектОбработки.ПолучитьСписокФайловВыгрузки();
	СписокДляКлиента   = Новый СписокЗначений;
	
	Для Каждого Файл Из СписокФайловСервер Цикл
		// Читаем файл с диска сервера в двоичные данные
		ДанныеФайла = Новый ДвоичныеДанные(Файл.Значение);
		// Помещаем в хранилище. Адрес будет доступен на клиенте до закрытия формы.
		Адрес = ПоместитьВоВременноеХранилище(ДанныеФайла, ЭтаФорма.УникальныйИдентификатор);
		// Передаем клиенту адрес вместо пути
		СписокДляКлиента.Добавить(Адрес, Файл.Представление);
	КонецЦикла;
	
	Возврат СписокДляКлиента;
		
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// При запуске устанавливаем видимость согласно режиму по умолчанию
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура РежимВыгрузкиПриИзменении(Элемент)
	Если Объект.РежимВыгрузки <> 1 Тогда
		Объект.ОчиститьРегистрПослеВыгрузки = Ложь;
	КонецЕсли;
	
	УправлениеВидимостью();
	
	Если Объект.РежимВыгрузки = 2 Тогда
		// Для начала дня - 00:00:00
		ТекДатаНачала = ?(ЗначениеЗаполнено(Объект.ДатаНачала), Объект.ДатаНачала, ТекущаяДата());
		Объект.ДатаНачала = НачалоДня(ТекДатаНачала);
		
		// Для окончания дня - 23:59:59 
		ТекДатаОкончания = ?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания, ТекущаяДата());
		Объект.ДатаОкончания = КонецДня(ТекДатаОкончания);
		
		Сообщить("Дата окончания: " + Объект.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура УправлениеВидимостью()
	
	// Режим 0 - Полная
	// Режим 1 - Изменения (РИКС) -> Даты НЕ НУЖНЫ
	// Режим 2 - Тестовая выгрузка 
	
	Режим = Объект.РежимВыгрузки; 
	
	// 1. Блоки дат и выбора категорий нужны ТОЛЬКО для Тестовой выгрузки (2)
	Элементы.ГруппаПериод.Видимость = (Режим = 2);
	Элементы.ГруппаТест.Видимость   = (Режим = 2);
	
	// 2. Флажок очистки нужен ТОЛЬКО для выгрузки По изменениям (1)
	Элементы.ОчиститьРегистрПослеВыгрузки.Видимость = (Режим = 1);
		
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюНаСервере()
	
	Режим = Объект.РежимВыгрузки;
	
	// Дублируем логику для сервера
	Элементы.ГруппаПериод.Видимость = (Режим = 2);
	Элементы.ГруппаТест.Видимость   = (Режим = 2);
	Элементы.ОчиститьРегистрПослеВыгрузки.Видимость = (Режим = 1);
	
КонецПроцедуры

// папка с выгрузкой JSON временно
// { ПРАВКА_НАЧАЛО: Кнопка быстрого доступа к результатам }
&НаКлиенте
Процедура AVS_ОткрытьПапкуСРезультатами(Команда)
	
	// Получаем путь через сервер, так как функция системная
	Путь = AVS_ПолучитьПутьКФайламНаСервере();
	
	// Запускаем проводник Windows
	ЗапуститьПриложение("explorer """ + Путь + """");
	
	Сообщить("[AVS DEBUG]: Открыта папка: " + Путь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция AVS_ПолучитьПутьКФайламНаСервере()
	Возврат КаталогВременныхФайлов();
КонецФункции

&НаКлиенте
Процедура ВыбратьПуть(Команда)
	// Диалог выбора папки на локальном ПК
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите папку для сохранения JSON-файлов";
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПути", ЭтотОбъект);
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПути(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		КаталогВыгрузки = ВыбранныеФайлы[0];
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура СформироватьJSONПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		КаталогВыгрузки = ВыбранныеФайлы[0];
		// После выбора папки продолжаем выгрузку
		ВыполнитьВыгрузкуИСохранениеЛокально();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуИСохранениеЛокально()
	
	// Получаем список АДРЕСОВ во временном хранилище
	СписокФайлов = ВыполнитьВыгрузкуНаСервере();
	
	Если СписокФайлов = Неопределено Или СписокФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекКаталог = ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "КаталогВыгрузки"), Объект.КаталогВыгрузки, КаталогВыгрузки);

	Для Каждого ФайлИзСписка Из СписокФайлов Цикл
		АдресВХранилище = ФайлИзСписка.Значение; // Ссылка вида e1cib/tempstorage/...
		ИмяФайла        = ФайлИзСписка.Представление;
		
		Разделитель = ?(Найти(ТекКаталог, "/") > 0, "/", "\");
		ПутьНаКлиенте = ТекКаталог + ?(Прав(ТекКаталог, 1) = Разделитель, "", Разделитель) + ИмяФайла;
		
		// Теперь ПолучитьФайл видит адрес в хранилище и сохраняет его по локальному пути
		ПолучитьФайл(АдресВХранилище, ПутьНаКлиенте, Ложь);
	КонецЦикла;
	
	ПоказатьОповещениеПользователя("Выгрузка завершена", , "Файлы сохранены в: " + ТекКаталог);
	
КонецПроцедуры

// { ПРАВКА_КОНЕЦ } 

&НаКлиенте
Процедура AVS_ПоказатьПредпросмотр(Команда)
	
	ПараметрыВыгрузки = Новый Структура;
	// Возвращаем префикс "Объект.", так как реквизиты принадлежат объекту обработки
	ПараметрыВыгрузки.Вставить("Режим",               Объект.РежимВыгрузки);
	ПараметрыВыгрузки.Вставить("ДатаНачала",          Объект.ДатаНачала);
	ПараметрыВыгрузки.Вставить("ДатаОкончания",       Объект.ДатаОкончания);
	ПараметрыВыгрузки.Вставить("КорневаяКатегория",   Объект.КорневаяКатегория);
	
	Результат = AVS_ПолучитьДанныеПредпросмотраНаСервере(ПараметрыВыгрузки);
	
	ПараметрыФормы = Новый Структура("Данные", Результат);
	ОткрытьФорму("ВнешняяОбработка.AVS_ВыгрузкаДанных.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция AVS_ПолучитьДанныеПредпросмотраНаСервере(ПараметрыВыгрузки)
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектОбработки.ПолучитьДанныеДляПредпросмотра(ПараметрыВыгрузки);
КонецФункции
